Repository: mohammaddhossamm/Fresh-News-app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# slogan
source: Hello News , Hello World..!
ar: مرحبا بالأخبار..مرحبا بالعالم..!

source: Skip
ar: تخطي

# discoverTitle
source: Dicover
ar: إكتشف

# onBordingtitle1
source: Choose the language
ar: إختــر اللغـــــة

# onBordingtitle2
source: Do you follow world news?
ar: هل تتابع أخبار العالم؟

# onBordingDescription2
source: You can now view the latest news around the world from our application.
ar: يمكنك الأن الإطلاع على أحدث الأخبار حول العالم من تطبيقنا.

# onBordingtitle3
source: Categories and subcategories
ar: الفئات والفئات الفرعية

# onBordingDescription3
source: You can now view news categories such as sports - business - health - education, etc. You can also find the latest news in sub-categories such as football, basketball, the stock market, etc....
ar: يمكنك الأن الإطلاع على فئات من الاخبار مثل : الرياضة - إدارة الأعمال- الصحة - التعليم وغيرها كما يمكنك معرفة أحدث الأخبار في الفئات الفرعية مثل كرة القدم والسلة والبورصه وغيرها....

# discoverNavBar
source: Dicover
ar: إكتشف

# exploreNavBar
source: Explore
ar: إبحث

# settingsTitle
source: Settings
ar: الإعدادات

# topCat
source: Top
ar: شائع

# sportCat
source: Sports
ar: الرياضة

# businessCat
source: Business
ar: إدارة الأعمال

# educationCat
source: Education
ar: التعليم

# worldCat
source: World
ar: العالم

# techCat
source: Technology
ar: التكنولوجيا

# healthCat
source: Health
ar: الصحة

# titleSubCat
source: Explore
ar: بحث عن

source: See more
ar: رؤية المزيد

# topSubCat
source: Top
ar: شائع

# sportsSubCat
source: Sports
ar: رياضة

# footballSubCat
source: Football
ar: كرة القدم

# basketSubCat
source: Basketball
ar: كرة السلة

# americanfootballSubCat
source: American football
ar: كرة القدم الامريكي

# karateSubCat
source: karate
ar: الكاراتيه

# racingSubCat
source: Racing
ar: سباق السيارات

# businessSubCat
source: Business
ar: إدارة الأعمال

# econoSubCat
source: Economics
ar: إقتصاد

# stockSubCat
source: Stock market
ar: بورصة

# financeSubCat
source: Finance
ar: تمويل

# marketingSubCat
source: Marketing
ar: تسويق

# eduSubCat
source: Education
ar: تعليم

# worldSubCat
source: World
ar: العالم

# palestineSubCat
source: Palestine
ar: فلسطين

# tecSubCat
source: Technology
ar: التكنولوجيا

# healthSubCat
source: Health
ar: الصحة

# lastesNewsTitle
source: Latest News
ar: أحدث الأخبار

# exploreViewTitle
source: Explore
ar: البحث

# searchTFF
source: Search:
ar: ابحث عن...

source: Results
ar: نتائج البحث:

source: Dark Mode
ar: الوضع الداكن

# lightSwitch
source: Light
ar: فاتح

# darkSwitch
source: Dark
ar: داكن

source: Language
ar: اللغة

# errorInternetTimeout
source: Internet connection timeout
ar: انتهت مهلة الاتصال بالإنترنت

# errorInternetConnection
source: Check your internet connection
ar: أنت غير متصل بالانترنت، تحقق من اتصالك بالإنترنت

# errorSendTimeout
source: Send request timeout
ar: حدث خطأ في إرسال طلبك

# errorReceiveTimeout
source: Receive request timeout
ar: حدث خطأ في استقبال طلبك

# errorBadCertificate
source: A bad certificate with a server
ar: حدث خطأ مع الخادم

# error404
source: Your request has not been found, please check your request or try again later
ar: لم يتم العثور على طلبك، يرجى التحقق من طلبك أو المحاولة مرة أخرى في وقت لاحق

# error500
source: Server error, please try again later
ar: حدث خطأ في الخادم، يرجى المحاولة مرة أخرى لاحقًا

# errorNum
source: Oops, you have exceeded the permissible limit of daily news results, as it is allowed to count (200) news per day at a rate of (30) news per quarter of an hour, please try later, also you can go to the search and search for what you want from the news.
ar: عفوًا، لقد تجاوزت الحد المسموح به من نتائج الأخبار اليومية حيث انه مسموح بعدد(200) خبر في اليوم الواحد بمعدل (30) خبر في كل ربع ساعه ، يرجى المحاولة لاحقاً ، أيضا يمكنك الذهاب إلى البحث وابحث عن ما تريد من الأخبار

# errorNumSearch
source: Oops, you have exceeded the allowed limit of news results, as you are allowed daily to count (100) news from the search results at a rate of (50) news every 12 hours, please try later
ar: عفواً، لقد تخطيت الحد المسموح به من نتائج الاخبار حيث انه مسموح لك يومياً بعدد(100) خبر من نتائج البحث بمعدل (50) خبر كل 12 ساعة، من فضلك حاول لاحقاً

# errorCancel
source: Your request was canceled
ar: تم إلغاء طلبك

# errorUnKnown
source: Unexpected Error, please try again
ar: حدث خطأ غير متوقع، يرجى المحاولة مرة أخرى

# errorImage
source: This news does not contain an image
ar: هذا الخبر لا يحتوى على صورة توضيحية

# homeListEmpty
source: There is no recent news about this topic today, you can choose another topic at the moment or you can go to the search
ar: لا توجد أخبار حديثة حول هذا الموضوع اليوم، يمكنك اختيار تخصص متفرع أخر في الوقت الحالي أو يمكنك الذهاب إلى مربع البحث

# searchListEmpty
source: There is no news about this topic currently. You can search for another topic, knowing you must write the name correctly without spelling errors.
ar: لا توجد أخبار حول هذا الموضوع حالياً، يمكنك البحث عن موضوع أخر مع العلم أنه يجب عليك كتابة اسم الموضوع بشكل صحيح بدون أخطاء إملائية.

# textFormError
source: Enter text to search
ar: أخدل النص الذي تريد البحث عنه

source: About us
ar: معلومات عنا

source: Overview
ar: نظره عامة

# overview1
source: The Hello World application is a special application for news around the world in more than one field. On the home page, you will find some main search categories that you can choose from as they display the news in images. You will also find some sub-categories from which you can choose and the latest news related to them will be displayed in a listâ€”the latest news.
ar: تطبيق Hello World هو تطبيق لأخبار حول العالم في أكثر من مجال. ستجد في الصفحة الرئيسية بعض فئات البحث الرئيسية التي يمكنك الاختيار من بينها لأنها تعرض الأخبار بالصور. ستجد أيضًا بعض الفئات الفرعية التي يمكنك الاختيار من بينها وسيتم عرض آخر الأخبار المتعلقة بها في قائمة — آخر الأخبار.

# overview2
source: You will also find a special search page to search for any news you want.
ar: وستجد أيضًا صفحة بحث خاصة للبحث عن أي أخبار تريدها.

# overview3
source: On the settings page, you can choose the mode (dark - light) and also choose the language (English - Arabic).
ar: في صفحة الإعدادات يمكنك اختيار الوضع (داكن - فاتح) وأيضا اختيار اللغة (الإنجليزية - العربية).

source: NB:
ar: ملحوظة::

# nb1
source: This news has a specific daily limit that cannot be exceeded, as the main page news has a specific limit, which is 200 searches per day, with an average of 30 searches in a quarter of an hour. When this message appears, you can try again after the first quarter of an hour the next day.
ar: هذا الخبر له حد يومي محدد لا يمكن تجاوزه، حيث أن أخبار الصفحة الرئيسية لها حد محدد وهو 200 عملية بحث يوميا، بمتوسط ​​30 عملية بحث في ربع ساعة. عند ظهور هذه الرسالة، يمكنك المحاولة مرة أخرى بعد أول ربع ساعة في اليوم التالي.

# nb2
source: The news search page has a specific limit of 100 searches per day, with an average of 50 searches within 12 hours. When this message appears, you can try it again after 12 hours or the next day.
ar: تحتوي صفحة البحث عن الأخبار على حد محدد يبلغ 100 عملية بحث يوميًا، بمتوسط ​​50 عملية بحث خلال 12 ساعة. عندما تظهر هذه الرسالة، يمكنك المحاولة مرة أخرى بعد 12 ساعة أو في اليوم التالي.

source: Features
ar: المكتبات المستخدمه

source: About Programmer
ar: لمحه عن مبرمج التطبيق

# mohamed
source: Mohamed Hossam
ar: محمـــد حســـام

# flutter
source: Flutter Developer
ar: مطور تطبيقات الهاتف بإستخدام Flutter

# snakBarSuccess
source: Succesfully Launched
ar: عملية ناجحة

# snakBarError
source: Error in Launched
ar: الرابط لا يعمل

# viewLink
source: View More
ar: رؤية المزيد
